flatPlate_USact/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale           1;
hu            0.1;
hl           -0.1;
wU              3;
wL             -3;
xL            3.1;
xR           3.14;


vertices
(
    (-10 -10  .1)  // 0
    (-10 -10 -.1)  // 1
    (-10 $wL  .1)  // 2
    (-10 $wL -.1)  // 3
    (-10 $wU  .1)  // 4
    (-10 $wU -.1)  // 5
    (-10  10  .1)  // 6
    (-10  10 -.1)  // 7
    ( -4 -10  .1)  // 8
    ( -4 -10 -.1)  // 9
    ( -4 $hl  .1)  // 10
    ( -4 $hl -.1)  // 11
    ( -4 $hu  .1)  // 12
    ( -4 $hu -.1)  // 13
    ( -4  10  .1)  // 14
    ( -4  10 -.1)  // 15
    (  4 -10  .1)  // 16
    (  4 -10 -.1)  // 17
    (  4 $hl  .1)  // 18
    (  4 $hl -.1)  // 19
    (  4 $hu  .1)  // 20
    (  4 $hu -.1)  // 21
    (  4  10  .1)  // 22
    (  4  10 -.1)  // 23
    ( 20 -10  .1)  // 24
    ( 20 -10 -.1)  // 25
    ( 20 $wL  .1)  // 26
    ( 20 $wL -.1)  // 27
    ( 20 $wU  .1)  // 28
    ( 20 $wU -.1)  // 29
    ( 20  10  .1)  // 30
    ( 20  10 -.1)  // 31
    ($xL $hu  .1)  // 32
    ($xL $hu -.1)  // 33
    ($xL  10  .1)  // 34
    ($xL  10 -.1)  // 35
    ($xR $hu  .1)  // 36
    ($xR $hu -.1)  // 37
    ($xR  10  .1)  // 38
    ($xR  10 -.1)  // 39
);

blocks
(
    hex ( 1  9 11  3  0  8 10  2) (120 198 1) simpleGrading (.125 .25   1)
    hex ( 3 11 13  5  2 10 12  4) (120  20 1) simpleGrading (.125   1   1)
    hex ( 5 13 15  7  4 12 14  6) (120 198 1) simpleGrading (.125   4   1)
    hex (13 33 35 15 12 32 34 14) (200 198 1) simpleGrading ( .25   4   1)
    hex (33 37 39 35 32 36 38 34) ( 40 198 1) simpleGrading (   1   4   1)
    hex (37 21 23 39 36 20 22 38) ( 80 198 1) simpleGrading (   2   4   1)
    hex (21 29 31 23 20 28 30 22) (240 198 1) simpleGrading (  16   4   1)
    hex (19 27 29 21 18 26 28 20) (240  20 1) simpleGrading (  16   1   1)
    hex (17 25 27 19 16 24 26 18) (240 198 1) simpleGrading (  16 .25   1)
    hex ( 9 17 19 11  8 16 18 10) (250 198 1) simpleGrading (  1  .25   1)
);

edges
(
    arc  12 10 180.0 ( 0  0  1)
    arc  13 11 180.0 ( 0  0  1)
    arc  18 20 180.0 ( 0  0  1)
    arc  19 21 180.0 ( 0  0  1)
);

boundary
(
    down
    {
        type symmetryPlane;
        faces
        (
            ( 0  8  9  1)
            ( 8 16 17  9)
            (16 24 25 17)
        );
    }
    right
    {
        type patch;
        faces
        (
            (24 25 27 26)
            (26 27 29 28)
            (28 29 31 30)
        );
    }
    up
    {
        type symmetryPlane;
        faces
        (
            (6  14 15  7)
            (15 14 34 35)
            (35 34 38 39)
            (39 38 22 23)
            (23 22 30 31)

        );
    }
    left
    {
        type patch;
        faces
        (
            (0 1 3 2)
            (2 3 5 4)
            (4 5 7 6)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (13 12 32 33)
            (10 11 13 12)
            (11 19 18 10)
            (18 19 21 20)
            (37 36 20 21)
        );
    }
    slot
    {
        type patch;
        faces
        (
            (33 32 36 37)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
