flatPlate_USact/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          610;
        startFace       523874;
    }
    right
    {
        type            patch;
        nFaces          416;
        startFace       524484;
    }
    up
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          680;
        startFace       524900;
    }
    left
    {
        type            patch;
        nFaces          416;
        startFace       525580;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          570;
        startFace       525996;
    }
    slot
    {
        type            patch;
        nFaces          40;
        startFace       526566;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          525240;
        startFace       526606;
    }
)

// ************************************************************************* //
